# Chapter 7 - Data Cleaning & Preparation (p.191-219)

## 7.1 Handling Missing Data (p.191)

In [4]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## Filtering Out Missing Data (p.193)

In [10]:
from numpy import nan as NA

In [11]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])

In [15]:
cleaned = data.dropna()

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7, 3))

In [23]:
df.iloc[:4, 1] = NA

In [24]:
df.iloc[:2, 2] = NA

In [25]:
df

          0         1         2
0 -0.240436       NaN       NaN
1 -1.470470       NaN       NaN
2  1.471440       NaN -0.332433
3 -0.497475       NaN -1.484976
4  0.437226 -1.132180  0.825380
5  1.473299  0.729081  0.607224
6 -0.608030 -0.176880 -1.727362

In [26]:
df.dropna()

          0         1         2
4  0.437226 -1.132180  0.825380
5  1.473299  0.729081  0.607224
6 -0.608030 -0.176880 -1.727362

In [27]:
df.dropna(thresh=2)

          0         1         2
2  1.471440       NaN -0.332433
3 -0.497475       NaN -1.484976
4  0.437226 -1.132180  0.825380
5  1.473299  0.729081  0.607224
6 -0.608030 -0.176880 -1.727362

## Filling in Missing Data (p. 195)

In [28]:
df.fillna(0)

          0         1         2
0 -0.240436  0.000000  0.000000
1 -1.470470  0.000000  0.000000
2  1.471440  0.000000 -0.332433
3 -0.497475  0.000000 -1.484976
4  0.437226 -1.132180  0.825380
5  1.473299  0.729081  0.607224
6 -0.608030 -0.176880 -1.727362

In [29]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.240436  0.500000  0.000000
1 -1.470470  0.500000  0.000000
2  1.471440  0.500000 -0.332433
3 -0.497475  0.500000 -1.484976
4  0.437226 -1.132180  0.825380
5  1.473299  0.729081  0.607224
6 -0.608030 -0.176880 -1.727362

In [30]:
_ = df.fillna(0, inplace=True)

In [31]:
df

          0         1         2
0 -0.240436  0.000000  0.000000
1 -1.470470  0.000000  0.000000
2  1.471440  0.000000 -0.332433
3 -0.497475  0.000000 -1.484976
4  0.437226 -1.132180  0.825380
5  1.473299  0.729081  0.607224
6 -0.608030 -0.176880 -1.727362

In [32]:
df = pd.DataFrame(np.random.randn(6, 3))

In [33]:
df.iloc[2:, 1] = NA

In [34]:
df.iloc[4:, 2] = NA

In [35]:
df

          0         1         2
0  0.802377  0.669412 -0.850562
1  1.693357 -0.958077  0.677773
2 -0.963605       NaN  1.064306
3  1.283774       NaN -0.928012
4 -0.516778       NaN       NaN
5  0.215094       NaN       NaN

In [36]:
df.fillna(method='ffill')

          0         1         2
0  0.802377  0.669412 -0.850562
1  1.693357 -0.958077  0.677773
2 -0.963605 -0.958077  1.064306
3  1.283774 -0.958077 -0.928012
4 -0.516778 -0.958077 -0.928012
5  0.215094 -0.958077 -0.928012

In [37]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.802377  0.669412 -0.850562
1  1.693357 -0.958077  0.677773
2 -0.963605 -0.958077  1.064306
3  1.283774 -0.958077 -0.928012
4 -0.516778       NaN -0.928012
5  0.215094       NaN -0.928012

In [38]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [39]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation (p.197)

### Removing Duplicates (ibd)

In [40]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [41]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [42]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [43]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [44]:
data['v1'] = range(7)

In [45]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [46]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [ ]:
### Transforming Data Using a Function or Mapping (p. 198)